# import pandas as pd
#
# df = pd.read_csv("datasets/student-mat.csv")
# shape_table = df.shape
#
# print("---------------------------------------------------------------------------------------------------------------")
# print(df.head(10))
# print("---------------------------------------------------------------------------------------------------------------")
# print(f"Размер таблицы: {shape_table}")
# print("---------------------------------------------------------------------------------------------------------------")
#
# observations_table = shape_table[0]
# print("---------------------------------------------------------------------------------------------------------------")
# print(f"Количество наблюдений - {observations_table}")
# print("---------------------------------------------------------------------------------------------------------------")
# print(df.info)
#
# observations_info_table = 395
#
# if observations_info_table == observations_table:
#     print(f"Решение верно, количество наблюдений равно {observations_table}")
# else:
#     print("Решение неверно, проверьте ещё раз!")

import pandas as pd
df = pd.read_csv("../datasets/Titanic.csv")
print(df.head(10))

